sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
	// Get proper values for the validation structure indicating that we can use 
	// these EEPROM/Flash contents on future boot ups
	NVMValidationStruct.wOriginalChecksum = wOriginalAppConfigChecksum;
	NVMValidationStruct.wCurrentChecksum = CalcIPChecksum((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
	NVMValidationStruct.wConfigurationLength = sizeof(APP_CONFIG);

	// Write the validation struct and current AppConfig contents to EEPROM/Flash
	#if defined(EEPROM_CS_TRIS)
	    XEEBeginWrite(0x0000);
	    XEEWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		XEEWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
    #elif defined(SPIRTCSRAM_CS_TRIS)
        SPISRAMBeginWrite(0x0000);
		SPISRAMWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		SPISRAMWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));        
    #else
		SPIFlashBeginWrite(0x0000);
		SPIFlashWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		SPIFlashWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
		
    #endif
}
#endif

// должна возвращать значение ускорения в зависимости от скорости
// F - частота полных шагов
// L - момент инерции системы
int Calculate_A(WORD f, double *A)
{
	//WORD f = (WORD)(F/FREQ_STEP);
	if(f < ACCELERATE_SIZE){
		*A = Accelerate[f];
	} else {
		*A = Accelerate[ACCELERATE_SIZE-1];
	}
	return 0;
}

// функция возвращает время, прошедшее
// при движении с заданными параметрами на промежутке (Xbeg,Xend), 
// при начальной скорости V и ускорении A
int Calculate_dT(double Xbeg, double Xend, double V, double A, double* T)
{
	double T1 = 0.0;
	double T2 = 0.0;
	int res = 0;
	if((A==0.0)&&(V==0.0)){
		return -1; // ошибка
	}
	if((A == 0)&&(V != 0.0)){
		*T = (Xend-Xbeg)/V;
		return 0;  // нет ошибки
	}
	// Xend = Xbeg + V*T + (A * T^2)/2
	// (A/2)T^2 + V*T + (Xbeg - Xend) = 0
	//res = SolvQuadratic(A/2,V,(Xbeg-Xend),&T1, &T2); 
	res = SolvQuadratic(A,V,(Xbeg-Xend),&T1/*, &T2*/); 
	if(res > 0) {
		*T = T1;
		return 0;
	}
	else return 1;
}
// вычисляет больший корень квадратного уравнения
int SolvQuadratic(double A, double B, double C, double* X1/*, double* X2*/)
{
	// Ax^2+Bx+C=0
	double D;// = 0.0;
	if((X1 == NULL) /*|| (X2 == NULL)*/) 
		return -1; // ошибка: неверные указатели
	//*X1 = 0.0;
	//*X2 = 0.0;
	if(A == 0.0){
		// Bx+C = 0
		// x = -C/B
		if(C!=0.0){
			*X1 = -B/C;
		} else {
			*X1 = 0.0;
		}
		return 1; // не квадратное уравнение, один корень
	}
	//D = B*B - 4.0 * A * C;
	D = B*B - 2.0 * A * C;
	if(D<0.0) {
		*X1=0.0;
		return 0; // дискриминант 0 корней нет
	}

	*X1 = (-B+sqrtf(D))/A;
	//*X1 = (-B+sqrtf(D))/(2*A);
	//*X2 = (-B-sqrtf(D))/(2*A);
	return 2; // два корня уравнения
}
/**************************************************************************
 * M = Ia =>   a = M/I
 * M - момент силы
 * I - момент инерции
 * a - угловое ускорение в радианах в секунду за секунду
 * для альфы: ( сплошной цилиндр длинны l, радиуса r и массы m, ось перпендикулярна целиндру и проходит через его середину)
 * I = (m*r^2/4) + (m*l^2)/12  
 * 
 * для дельты: ( полый тонкостенный цилиндр длинны l, радиуса r и массы m, ось перпендикулярна целиндру и проходит через его середину)
 * I = (m*r^2/2)+ (m*l^2/12)
 **************************************************************************
 * Параметры функции
 * Power - массив моментов силы двигателя
 * Freq  - массив частот шагов двигателя
 * Len   - размер массивов
 * I	 - Момент инерции  
 * 
 ************************************************************************/
int InitAccelerate(FREQ_POWER* FqPwr, WORD Len, double I)
{    
	double Lm = 0.0;
	int i;
	int j;
    double Freq1;
    double Freq2;
    double Pw1;
    double Pw2;
    BYTE b = 0;
	double F = 0;
	for(j = 0; j < ACCELERATE_SIZE; j++){
		for(i = 0; i< Len-1; i++){
            Freq1 = FqPwr[i].Freq;  
            Freq2 = FqPwr[i+1].Freq;            
			if((F >= Freq1) && (F < Freq2)){
				Pw1 = FqPwr[i].Power;
				Pw2 = FqPwr[i+1].Power;
				Lm = LinInt(Freq1,Pw1,Freq2,Pw2, F);
                b = 1;
				break;
			}
		}
		if(b == 0) 
            Lm = FqPwr[Len - 1].Power;
		F = F + FREQ_STEP;
		Accelerate[j] = Lm / I;
	}
	return 0;
}


void Calc(void)
{
    {
		const double  kk = 32.0;
		double A = 0.0; //ускорение в радианах в сек за сек
		double dt = 0.0; // изменение времени
		double V = 0.0;  // мгновенная скорость в радианах
		//static double dX = 1.0/(200.0*16.0);// шаг перемещения в градусах (в 1 градусе 3200 шагов)
		static double dX = kk*PI/(180.0*360.0*200.0*16.0); // шаг перемещения в радианах
		volatile double T = 0;    // полное время
		volatile double timer1 = 0.0;  // значение таймера
		WORD F = 0;
		volatile WORD i = 0;		
        double Vf = 180.0 * 200.0/(PI*FREQ_STEP);
        BYTE k = kk;
        double ddt = 0.0;
        do{
	        if(k>=kk)
			{
	            F =(WORD)(V * Vf); //F/FREQ_STEP  1/20 от частоты полных шагов
				Calculate_A(F, &A);
	            Calculate_dT(0, dX, V, A, &dt);
	            V = dX/dt;
	            //X += dX;
	  			k=0;
	  			ddt = dt/kk;
			}
			k++;	         
            T += ddt;
            timer1 = (DWORD)(T/0.0000002); // результат вычислений            
            i++;
        }while ( i < 3200);
        //i = 0
        //T = 0;
        //do{
        //    Calculate_A(V, 2/(Mass*Radius*Radius),&A);
        //    A = -A;
        //    if(Calculate_dT(0, dX, V, A, &dt)!=0){
        //        V=0;
        //    } else
        //    V = dX/dt;
            //X += dX;
        //    T += dt;
        //    timer1 = T/0.0000002; // результат вычислений
        //    i++;
        //}while ( i < 64);
    }
}
double LinInt(double x1,double y1,double x2,double y2, double x)
{
	if(x1!=x2) {
		return y1+(y2-y1)*(x-x1)/(x2-x1);
	}else return y1;
}